Revit 2024 API
IViewSheetSet.Views Property
The views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
ViewSet Views { get; set; }
Visual Basic
Property Views As ViewSet
	Get
	Set
Visual C++
property ViewSet^ Views {
	ViewSet^ get ();
	void set (ViewSet^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  Thrown when the input views is null.
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when the set operation failed due to invalid view which cannot be printed.
See Also
IViewSheetSet Interface
Autodesk.Revit.DB Namespace